In [1]:
import pandas as pd

In [3]:
df=pd.DataFrame({'roll':[101,102,103],'name':['sonu','monu','chintu']})

In [4]:
#add new column in the last or update if it is existing column
df['marks']=[600,450,700]

In [5]:
#add new column at given position(pos,colname,iterable)
df.insert(1,'branch',['cs','ec','cs'])

In [6]:
df

   roll branch    name  marks
0   101     cs    sonu    600
1   102     ec    monu    450
2   103     cs  chintu    700

In [9]:
#rename column
df.rename({'roll':'roll no'},axis=1,inplace=True)

In [10]:
df

   roll no branch    name  marks
0      101     cs    sonu    600
1      102     ec    monu    450
2      103     cs  chintu    700

In [11]:
#rename index
df.rename({1:'x',0:'a'},axis=0,inplace=True)

In [12]:
df

   roll no branch    name  marks
a      101     cs    sonu    600
x      102     ec    monu    450
2      103     cs  chintu    700

In [15]:
#get an element using index,col labels
print(df.at['x','name'])
print(df.at['a','roll no'])

#get an element using index,col positions
print(df.iat[1,2])
print(df.iat[0,0])

monu
101
monu
101

In [18]:
#update an element 
df.at['x','marks']=550
df.iat[0,3]=650

In [19]:
df

   roll no branch    name  marks
a      101     cs    sonu    650
x      102     ec    monu    550
2      103     cs  chintu    700

In [21]:
#get one row
print(df.loc['x'])
print(df.iloc[1])

roll no     102
branch       ec
name       monu
marks       550
Name: x, dtype: object
roll no     102
branch       ec
name       monu
marks       550
Name: x, dtype: object

In [22]:
#add one row in the last
df.loc['z']=[301,'IT','virat',800]

In [23]:
df

   roll no branch    name  marks
a      101     cs    sonu    650
x      102     ec    monu    550
2      103     cs  chintu    700
z      301     IT   virat    800

In [24]:
#update existing row
df.loc['a']=[303,'CS','viru',700]

In [25]:
df

   roll no branch    name  marks
a      303     CS    viru    700
x      102     ec    monu    550
2      103     cs  chintu    700
z      301     IT   virat    800

In [32]:
#update existing row
df.iloc[1]=[102,'EC','montu',560]

In [33]:
df

   roll no branch    name  marks
a      303     CS    viru    700
x      102     EC   montu    560
2      103     cs  chintu    700
z      104     EC   pintu    560

In [34]:
df.iloc[3]=[104,'EC','pintu',560]

In [35]:
df

   roll no branch    name  marks
a      303     CS    viru    700
x      102     EC   montu    560
2      103     cs  chintu    700
z      104     EC   pintu    560

In [38]:
#get one column
r=df['roll no']

In [40]:
type(r)

pandas.core.series.Series

In [41]:
df['name']

a      viru
x     montu
2    chintu
z     pintu
Name: name, dtype: object

In [42]:
df['marks']

a    700
x    560
2    700
z    560
Name: marks, dtype: int64

In [45]:
df.marks

a    700
x    560
2    700
z    560
Name: marks, dtype: int64

In [48]:
df['roll no']

a    303
x    102
2    103
z    104
Name: roll no, dtype: int64

In [50]:
#get multiple cols as dataframe
d1=df[['roll no','marks']]

In [51]:
d1

   roll no  marks
a      303    700
x      102    560
2      103    700
z      104    560

In [57]:
#how to get specific rows and cols
df.loc['a':'z','roll no':'name']

   roll no branch    name
a      303     CS    viru
x      102     EC   montu
2      103     cs  chintu
z      104     EC   pintu

In [58]:
#how to get specific rows and cols
df.iloc[0:3,0:2]

   roll no branch
a      303     CS
x      102     EC
2      103     cs

In [59]:
#how to get specific rows based on condition
df[df.marks>600]

   roll no branch    name  marks
a      303     CS    viru    700
2      103     cs  chintu    700

In [60]:
df

   roll no branch    name  marks
a      303     CS    viru    700
x      102     EC   montu    560
2      103     cs  chintu    700
z      104     EC   pintu    560

In [61]:
#sorting of rows based on a specific col
df.sort_values('roll no')

   roll no branch    name  marks
x      102     EC   montu    560
2      103     cs  chintu    700
z      104     EC   pintu    560
a      303     CS    viru    700

In [62]:
df.sort_values('roll no',ascending=False)

   roll no branch    name  marks
a      303     CS    viru    700
z      104     EC   pintu    560
2      103     cs  chintu    700
x      102     EC   montu    560

In [63]:
#how to get names of all columns
df.columns

Index(['roll no', 'branch', 'name', 'marks'], dtype='object')

In [68]:
for col_name in df:
    print(col_name)

roll no
branch
name
marks

In [69]:
df

   roll no branch    name  marks
a      303     CS    viru    700
x      102     EC   montu    560
2      103     cs  chintu    700
z      104     EC   pintu    560

In [70]:
df.columns=['Roll','Branch','Name','Marks']

In [71]:
df

   Roll Branch    Name  Marks
a   303     CS    viru    700
x   102     EC   montu    560
2   103     cs  chintu    700
z   104     EC   pintu    560

In [72]:
#get all index
df.index

Index(['a', 'x', 2, 'z'], dtype='object')

In [73]:
df.index=['A','B','C','D']

In [74]:
df

   Roll Branch    Name  Marks
A   303     CS    viru    700
B   102     EC   montu    560
C   103     cs  chintu    700
D   104     EC   pintu    560

In [75]:
df=pd.read_excel('e:/players.xlsx')
df

    virat  32  12000
0   rohit  33  10000
1  sachin  44  25000

In [76]:
df=pd.read_excel('e:/players.xlsx',header=None)
df

        0   1      2
0   virat  32  12000
1   rohit  33  10000
2  sachin  44  25000

In [77]:
df.columns=['name','age','runs']
df

     name  age   runs
0   virat   32  12000
1   rohit   33  10000
2  sachin   44  25000

In [80]:
df=pd.read_excel('e:/players.xlsx',names=['Name','Age','Runs'])
df

     Name  Age   Runs
0   virat   32  12000
1   rohit   33  10000
2  sachin   44  25000

In [81]:
df=pd.read_excel('e:/players.xlsx',header=None,names=['Name','Age','Runs'])
df

     Name  Age   Runs
0   virat   32  12000
1   rohit   33  10000
2  sachin   44  25000

In [82]:
df=pd.read_excel('e:/players.xlsx',sheet_name='football',header=None,names=['Name','Age','Runs'])
df

  Name  Age  Runs
0   vi   32  1200
1   ro   33  1000
2   sa   44  2500

In [83]:
df=pd.read_excel('e:/players.xlsx',sheet_name='cricket',header=None,names=['Name','Age','Runs'])
df

     Name  Age   Runs
0   virat   32  12000
1   rohit   33  10000
2  sachin   44  25000

In [84]:
df=pd.read_excel('e:/players.xlsx',sheet_name=0,header=None,names=['Name','Age','Runs'])
df

     Name  Age   Runs
0   virat   32  12000
1   rohit   33  10000
2  sachin   44  25000

In [85]:
df=pd.read_excel('e:/players.xlsx',sheet_name=1,header=None,names=['Name','Age','Runs'])
df

  Name  Age  Runs
0   vi   32  1200
1   ro   33  1000
2   sa   44  2500